<?php

return [
    'singular' => ' الجهاز المستخدم' ,
    'plural'   => 'أجهزة المستخدمين',
    'fields'   => [
        'id'               => '#',
        'user_id'          => 'المستخدم',
        'device_token'     => 'رمز الجهاز',
        'device_serial'    => 'الرقم التسلسلي للجهاز',
        'device_name'      => 'اسم الجهاز',
        'user_agent'       => 'وكيل المستخدم',
        'ip_address'       => 'عنوان IP',
        'device_type'      => 'نوع الجهاز',
        'browser'          => 'المتصفح',
        'os'               => 'نظام التشغيل',
        'status'           => 'الحالة',
        'last_activity_at' => 'آخر نشاط',
        'created_at'       => 'تم الإنشاء في',
        'updated_at'       => 'تم التحديث في',
        'exist'               => 'الجهاز مسجل مسبقا تواصل مع الدعم',
        'created'          => 'تم تسجيل الجهاز بنجاح، في انتظار التفعيل من الإدارة',
        'approved'          => 'تم تفعيل الجهاز بنجاح',
        'not_registered'          => 'الجهاز غير مسجل اضغط على تسجيل الجهاز',
        'not_approved'          => 'الجهاز غير مفعل تواصل مع الإدارة',
    ],
];
