<?php

return [
    'singular' => 'فترة  عمل',
    'plural' => 'فترات العمل',
    'static' => 'ثابت',
    'flexible' => 'مرن',
    'fields' => [
        'id' => 'Id',
        'name' => 'الإسم',
        'status' => 'الحالة',
        'type' => 'النوع',
        'work_hours' => 'ساعات العمل',
        'from' => 'من',
        'to' => 'إلى',
        'created_at' => 'تاريخ الإنشاء',
        'updated_at' => 'تاريخ التحديث',
        'work_days' => 'ايام العمل',
        'shifts' => 'الدوامات',
        'is_active' => 'نشط',

        'early_entry' => 'الدخول المبكر',
        'late_entry' => 'الدخول المتأخر',
        'early_exit' => 'الخروج المبكر',
        'late_exit' => 'الخروج المتأخر',
        'entry_start' => 'نهاية فترة الدخول',
        'exit_end' => 'بداية فترة الخروج',
        'exempt_days' => 'الأيام المعفى منها من الحضور',
        'start_date' => 'بداية التاريخ',
        'end_date' => 'نهاية التاريخ',
        'Specificperiod' => 'فترة محددة',





    ],

    'sections' => [
        'attendance_settings' => 'إعدادات الحضور والانصراف',
        'entry_period' => 'فترة تسجيل الحضور',
        'days_configuration' => 'إعدادات الأيام',
        'shifts' => 'أوقات الورديات',
        'Specificperiods' => 'الفترة محددة',
    ],

    'hints' => [

        'early_entry' => 'عدد الدقائق المسموحة للدخول قبل بداية الوردية (مثال: 30 دقيقة)',
        'late_entry' => 'عدد الدقائق المسموحة للتأخير عن بداية الوردية (مثال: 15 دقيقة)',
        'early_exit' => 'عدد الدقائق المسموحة للخروج قبل نهاية الوردية',
        'late_exit' => 'عدد الدقائق المسموحة للتأخر في الخروج بعد نهاية الوردية',
        'entry_period_start' => 'عدد الدقائق المسموح بها في الدخول',
        'entry_period_end' => 'عدد الدقائق المسموح بها في الخروج',
        'work_days' => 'حدد أيام العمل الرسمية للوردية',
        'exempt_days' => 'حدد الأيام المعفى منها الموظفون من الحضور (مثال: الجمعة والسبت)',


    ],

    'placeholders' => [
        'minutes' => 'بالدقائق',
    ],
];
